pellepl/baremetal/arch/msp/msp430/mdk/include/rf430f5144.h
#define DMASRCINCR_0           (0x0000)       /* DMA source increment 0: source address unchanged */
#define DMASRCINCR_1           (0x0100)       /* DMA source increment 1: source address unchanged */
#define DMASRCINCR_2           (0x0200)       /* DMA source increment 2: source address decremented */
#define DMASRCINCR_3           (0x0300)       /* DMA source increment 3: source address incremented */

#define DMADSTINCR_0           (0x0000)       /* DMA destination increment 0: destination address unchanged */
#define DMADSTINCR_1           (0x0400)       /* DMA destination increment 1: destination address unchanged */
#define DMADSTINCR_2           (0x0800)       /* DMA destination increment 2: destination address decremented */
#define DMADSTINCR_3           (0x0C00)       /* DMA destination increment 3: destination address incremented */

#define DMADT_0                (0x0000)       /* DMA transfer mode 0: Single transfer */
#define DMADT_1                (0x1000)       /* DMA transfer mode 1: Block transfer */
#define DMADT_2                (0x2000)       /* DMA transfer mode 2: Burst-Block transfer */
#define DMADT_3                (0x3000)       /* DMA transfer mode 3: Burst-Block transfer */
#define DMADT_4                (0x4000)       /* DMA transfer mode 4: Repeated Single transfer */
#define DMADT_5                (0x5000)       /* DMA transfer mode 5: Repeated Block transfer */
#define DMADT_6                (0x6000)       /* DMA transfer mode 6: Repeated Burst-Block transfer */
#define DMADT_7                (0x7000)       /* DMA transfer mode 7: Repeated Burst-Block transfer */

/* DMAIV Definitions */
#define DMAIV_NONE             (0x0000)       /* No Interrupt pending */
#define DMAIV_DMA0IFG          (0x0002)       /* DMA0IFG*/
#define DMAIV_DMA1IFG          (0x0004)       /* DMA1IFG*/
#define DMAIV_DMA2IFG          (0x0006)       /* DMA2IFG*/

#define DMA0TSEL_0             (0x0000)       /* DMA channel 0 transfer select 0  */
#define DMA0TSEL_1             (0x0001)       /* DMA channel 0 transfer select 1  */
#define DMA0TSEL_2             (0x0002)       /* DMA channel 0 transfer select 2  */
#define DMA0TSEL_3             (0x0003)       /* DMA channel 0 transfer select 3  */
#define DMA0TSEL_4             (0x0004)       /* DMA channel 0 transfer select 4  */
#define DMA0TSEL_5             (0x0005)       /* DMA channel 0 transfer select 5  */
#define DMA0TSEL_6             (0x0006)       /* DMA channel 0 transfer select 6  */
#define DMA0TSEL_7             (0x0007)       /* DMA channel 0 transfer select 7  */
#define DMA0TSEL_8             (0x0008)       /* DMA channel 0 transfer select 8  */
#define DMA0TSEL_9             (0x0009)       /* DMA channel 0 transfer select 9  */
#define DMA0TSEL_10            (0x000A)       /* DMA channel 0 transfer select 10 */
#define DMA0TSEL_11            (0x000B)       /* DMA channel 0 transfer select 11 */
#define DMA0TSEL_12            (0x000C)       /* DMA channel 0 transfer select 12 */
#define DMA0TSEL_13            (0x000D)       /* DMA channel 0 transfer select 13 */
#define DMA0TSEL_14            (0x000E)       /* DMA channel 0 transfer select 14 */
#define DMA0TSEL_15            (0x000F)       /* DMA channel 0 transfer select 15 */
#define DMA0TSEL_16            (0x0010)       /* DMA channel 0 transfer select 16 */
#define DMA0TSEL_17            (0x0011)       /* DMA channel 0 transfer select 17 */
#define DMA0TSEL_18            (0x0012)       /* DMA channel 0 transfer select 18 */
#define DMA0TSEL_19            (0x0013)       /* DMA channel 0 transfer select 19 */
#define DMA0TSEL_20            (0x0014)       /* DMA channel 0 transfer select 20 */
#define DMA0TSEL_21            (0x0015)       /* DMA channel 0 transfer select 21 */
#define DMA0TSEL_22            (0x0016)       /* DMA channel 0 transfer select 22 */
#define DMA0TSEL_23            (0x0017)       /* DMA channel 0 transfer select 23 */
#define DMA0TSEL_24            (0x0018)       /* DMA channel 0 transfer select 24 */
#define DMA0TSEL_25            (0x0019)       /* DMA channel 0 transfer select 25 */
#define DMA0TSEL_26            (0x001A)       /* DMA channel 0 transfer select 26 */
#define DMA0TSEL_27            (0x001B)       /* DMA channel 0 transfer select 27 */
#define DMA0TSEL_28            (0x001C)       /* DMA channel 0 transfer select 28 */
#define DMA0TSEL_29            (0x001D)       /* DMA channel 0 transfer select 29 */
#define DMA0TSEL_30            (0x001E)       /* DMA channel 0 transfer select 30 */
#define DMA0TSEL_31            (0x001F)       /* DMA channel 0 transfer select 31 */

#define DMA1TSEL_0             (0x0000)       /* DMA channel 1 transfer select 0  */
#define DMA1TSEL_1             (0x0100)       /* DMA channel 1 transfer select 1  */
#define DMA1TSEL_2             (0x0200)       /* DMA channel 1 transfer select 2  */
#define DMA1TSEL_3             (0x0300)       /* DMA channel 1 transfer select 3  */
#define DMA1TSEL_4             (0x0400)       /* DMA channel 1 transfer select 4  */
#define DMA1TSEL_5             (0x0500)       /* DMA channel 1 transfer select 5  */
#define DMA1TSEL_6             (0x0600)       /* DMA channel 1 transfer select 6  */
#define DMA1TSEL_7             (0x0700)       /* DMA channel 1 transfer select 7  */
#define DMA1TSEL_8             (0x0800)       /* DMA channel 1 transfer select 8  */
#define DMA1TSEL_9             (0x0900)       /* DMA channel 1 transfer select 9  */
#define DMA1TSEL_10            (0x0A00)       /* DMA channel 1 transfer select 10 */
#define DMA1TSEL_11            (0x0B00)       /* DMA channel 1 transfer select 11 */
#define DMA1TSEL_12            (0x0C00)       /* DMA channel 1 transfer select 12 */
#define DMA1TSEL_13            (0x0D00)       /* DMA channel 1 transfer select 13 */
#define DMA1TSEL_14            (0x0E00)       /* DMA channel 1 transfer select 14 */
#define DMA1TSEL_15            (0x0F00)       /* DMA channel 1 transfer select 15 */
#define DMA1TSEL_16            (0x1000)       /* DMA channel 1 transfer select 16 */
#define DMA1TSEL_17            (0x1100)       /* DMA channel 1 transfer select 17 */
#define DMA1TSEL_18            (0x1200)       /* DMA channel 1 transfer select 18 */
#define DMA1TSEL_19            (0x1300)       /* DMA channel 1 transfer select 19 */
#define DMA1TSEL_20            (0x1400)       /* DMA channel 1 transfer select 20 */
#define DMA1TSEL_21            (0x1500)       /* DMA channel 1 transfer select 21 */
#define DMA1TSEL_22            (0x1600)       /* DMA channel 1 transfer select 22 */
#define DMA1TSEL_23            (0x1700)       /* DMA channel 1 transfer select 23 */
#define DMA1TSEL_24            (0x1800)       /* DMA channel 1 transfer select 24 */
#define DMA1TSEL_25            (0x1900)       /* DMA channel 1 transfer select 25 */
#define DMA1TSEL_26            (0x1A00)       /* DMA channel 1 transfer select 26 */
#define DMA1TSEL_27            (0x1B00)       /* DMA channel 1 transfer select 27 */
#define DMA1TSEL_28            (0x1C00)       /* DMA channel 1 transfer select 28 */
#define DMA1TSEL_29            (0x1D00)       /* DMA channel 1 transfer select 29 */
#define DMA1TSEL_30            (0x1E00)       /* DMA channel 1 transfer select 30 */
#define DMA1TSEL_31            (0x1F00)       /* DMA channel 1 transfer select 31 */

