pellepl/baremetal/arch/msp/msp430/mdk/include/rf430f5144.h
/* TAxCCTLx Control Bits */
#define CM1                    (0x8000)       /* Capture mode 1 */
#define CM0                    (0x4000)       /* Capture mode 0 */
#define CCIS1                  (0x2000)       /* Capture input select 1 */
#define CCIS0                  (0x1000)       /* Capture input select 0 */
#define SCS                    (0x0800)       /* Capture sychronize */
#define SCCI                   (0x0400)       /* Latched capture signal (read) */
#define CAP                    (0x0100)       /* Capture mode: 1 /Compare mode : 0 */
#define OUTMOD2                (0x0080)       /* Output mode 2 */
#define OUTMOD1                (0x0040)       /* Output mode 1 */
#define OUTMOD0                (0x0020)       /* Output mode 0 */
#define CCIE                   (0x0010)       /* Capture/compare interrupt enable */
#define CCI                    (0x0008)       /* Capture input signal (read) */
#define OUT                    (0x0004)       /* PWM Output signal if output mode 0 */
#define COV                    (0x0002)       /* Capture/compare overflow flag */
#define CCIFG                  (0x0001)       /* Capture/compare interrupt flag */

#define OUTMOD_0               (0x0000)       /* PWM output mode: 0 - output only */
#define OUTMOD_1               (0x0020)       /* PWM output mode: 1 - set */
#define OUTMOD_2               (0x0040)       /* PWM output mode: 2 - PWM toggle/reset */
#define OUTMOD_3               (0x0060)       /* PWM output mode: 3 - PWM set/reset */
#define OUTMOD_4               (0x0080)       /* PWM output mode: 4 - toggle */
#define OUTMOD_5               (0x00A0)       /* PWM output mode: 5 - Reset */
#define OUTMOD_6               (0x00C0)       /* PWM output mode: 6 - PWM toggle/set */
#define OUTMOD_7               (0x00E0)       /* PWM output mode: 7 - PWM reset/set */
#define CCIS_0                 (0x0000)       /* Capture input select: 0 - CCIxA */
#define CCIS_1                 (0x1000)       /* Capture input select: 1 - CCIxB */
#define CCIS_2                 (0x2000)       /* Capture input select: 2 - GND */
#define CCIS_3                 (0x3000)       /* Capture input select: 3 - Vcc */
#define CM_0                   (0x0000)       /* Capture mode: 0 - disabled */
#define CM_1                   (0x4000)       /* Capture mode: 1 - pos. edge */
#define CM_2                   (0x8000)       /* Capture mode: 1 - neg. edge */
#define CM_3                   (0xC000)       /* Capture mode: 1 - both edges */

/* TAxEX0 Control Bits */
#define TAIDEX0                (0x0001)       /* Timer A Input divider expansion Bit: 0 */
#define TAIDEX1                (0x0002)       /* Timer A Input divider expansion Bit: 1 */
#define TAIDEX2                (0x0004)       /* Timer A Input divider expansion Bit: 2 */

#define TAIDEX_0               (0x0000)       /* Timer A Input divider expansion : /1 */
#define TAIDEX_1               (0x0001)       /* Timer A Input divider expansion : /2 */
#define TAIDEX_2               (0x0002)       /* Timer A Input divider expansion : /3 */
#define TAIDEX_3               (0x0003)       /* Timer A Input divider expansion : /4 */
#define TAIDEX_4               (0x0004)       /* Timer A Input divider expansion : /5 */
#define TAIDEX_5               (0x0005)       /* Timer A Input divider expansion : /6 */
#define TAIDEX_6               (0x0006)       /* Timer A Input divider expansion : /7 */
#define TAIDEX_7               (0x0007)       /* Timer A Input divider expansion : /8 */

/* T0A3IV Definitions */
#define TA0IV_NONE             (0x0000)       /* No Interrupt pending */
#define TA0IV_TACCR1           (0x0002)       /* TA0CCR1_CCIFG */
#define TA0IV_TACCR2           (0x0004)       /* TA0CCR2_CCIFG */
#define TA0IV_3                (0x0006)       /* Reserved */
#define TA0IV_4                (0x0008)       /* Reserved */
#define TA0IV_5                (0x000A)       /* Reserved */
#define TA0IV_6                (0x000C)       /* Reserved */
#define TA0IV_TAIFG            (0x000E)       /* TA0IFG */

/* Legacy Defines */
#define TA0IV_TA0CCR1          (0x0002)       /* TA0CCR1_CCIFG */
#define TA0IV_TA0CCR2          (0x0004)       /* TA0CCR2_CCIFG */
#define TA0IV_TA0IFG           (0x000E)       /* TA0IFG */

/************************************************************
* Timer0_D3
************************************************************/
#define __MSP430_HAS_T0D3__                   /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_T0D3__ 0x0B00
#define TIMER_D0_BASE          __MSP430_BASEADDRESS_T0D3__

sfr_w(TD0CTL0);                               /* Timer0_D3 Control 0 */
sfr_w(TD0CTL1);                               /* Timer0_D3 Control 1 */
sfr_w(TD0CTL2);                               /* Timer0_D3 Control 2 */
sfr_w(TD0R);                                  /* Timer0_D3 Counter */
sfr_w(TD0CCTL0);                              /* Timer0_D3 Capture/Compare Control 0 */
sfr_w(TD0CCR0);                               /* Timer0_D3 Capture/Compare 0 */
sfr_w(TD0CL0);                                /* Timer0_D3 Capture/Compare Latch 0 */
sfr_w(TD0CCTL1);                              /* Timer0_D3 Capture/Compare Control 1 */
sfr_w(TD0CCR1);                               /* Timer0_D3 Capture/Compare 1 */
sfr_w(TD0CL1);                                /* Timer0_D3 Capture/Compare Latch 1 */
sfr_w(TD0CCTL2);                              /* Timer0_D3 Capture/Compare Control 2 */
sfr_w(TD0CCR2);                               /* Timer0_D3 Capture/Compare 2 */
sfr_w(TD0CL2);                                /* Timer0_D3 Capture/Compare Latch 2 */
sfr_w(TD0HCTL0);                              /* Timer0_D3 High-resolution Control Register 0 */
sfr_w(TD0HCTL1);                              /* Timer0_D3 High-resolution Control Register 1 */
sfr_w(TD0HINT);                               /* Timer0_D3 High-resolution Interrupt Register */
sfr_w(TD0IV);                                 /* Timer0_D3 Interrupt Vector Word */

/* TDxCTL0 Control Bits */
#define TDCLGRP1               (0x4000)       /* Timer0_D3 Compare latch load group 1 */
#define TDCLGRP0               (0x2000)       /* Timer0_D3 Compare latch load group 0 */
#define CNTL1                  (0x1000)       /* Counter lenght 1 */
#define CNTL0                  (0x0800)       /* Counter lenght 0 */
#define TDSSEL1                (0x0200)       /* Clock source 1 */
#define TDSSEL0                (0x0100)       /* Clock source 0 */
#define TDCLR                  (0x0004)       /* Timer0_D3 counter clear */
#define TDIE                   (0x0002)       /* Timer0_D3 interrupt enable */
#define TDIFG                  (0x0001)       /* Timer0_D3 interrupt flag */

#define SHR1                   (0x4000)       /* Timer0_D3 Compare latch load group 1 */
#define SHR0                   (0x2000)       /* Timer0_D3 Compare latch load group 0 */

#define TDSSEL_0               (0x0000)       /* Clock Source: TDCLK */
#define TDSSEL_1               (0x0100)       /* Clock Source: ACLK  */
#define TDSSEL_2               (0x0200)       /* Clock Source: SMCLK */
#define TDSSEL_3               (0x0300)       /* Clock Source: INCLK */
#define CNTL_0                 (0x0000)       /* Counter lenght: 16 bit */
#define CNTL_1                 (0x0800)       /* Counter lenght: 12 bit */
#define CNTL_2                 (0x1000)       /* Counter lenght: 10 bit */
#define CNTL_3                 (0x1800)       /* Counter lenght:  8 bit */
#define SHR_0                  (0x0000)       /* Timer0_D3 Group: 0 - individually */
#define SHR_1                  (0x2000)       /* Timer0_D3 Group: 1 - 3 groups (1-2, 3-4, 5-6) */
#define SHR_2                  (0x4000)       /* Timer0_D3 Group: 2 - 2 groups (1-3, 4-6)*/
#define SHR_3                  (0x6000)       /* Timer0_D3 Group: 3 - 1 group (all) */
#define TDCLGRP_0              (0x0000)       /* Timer0_D3 Group: 0 - individually */
#define TDCLGRP_1              (0x2000)       /* Timer0_D3 Group: 1 - 3 groups (1-2, 3-4, 5-6) */
#define TDCLGRP_2              (0x4000)       /* Timer0_D3 Group: 2 - 2 groups (1-3, 4-6)*/
#define TDCLGRP_3              (0x6000)       /* Timer0_D3 Group: 3 - 1 group (all) */
#define TDSSEL__TACLK          (0x0000)       /* Timer0_D3 clock source select: 0 - TACLK */
#define TDSSEL__ACLK           (0x0100)       /* Timer0_D3 clock source select: 1 - ACLK  */
#define TDSSEL__SMCLK          (0x0200)       /* Timer0_D3 clock source select: 2 - SMCLK */
#define TDSSEL__INCLK          (0x0300)       /* Timer0_D3 clock source select: 3 - INCLK */
#define CNTL__16               (0x0000)       /* Counter lenght: 16 bit */
#define CNTL__12               (0x0800)       /* Counter lenght: 12 bit */
#define CNTL__10               (0x1000)       /* Counter lenght: 10 bit */
#define CNTL__8                (0x1800)       /* Counter lenght:  8 bit */

